Immence/Arduino/boards.txt
menu.UploadSpeed=Upload Speed
menu.CpuFrequency=CPU Frequency
menu.FlashSize=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.ESPModule=Module
menu.Debug=Debug port
menu.DebugLevel=Debug Level
menu.LwIPVariant=lwIP Variant
menu.HardcodedNetwork=Hardcoded network

##############################################################
sepio-nodemcu.name=Sepio: NodeMCU

sepio-nodemcu.upload.tool=esptool
sepio-nodemcu.upload.speed=115200
sepio-nodemcu.upload.resetmethod=nodemcu
sepio-nodemcu.upload.maximum_size=1044464
sepio-nodemcu.upload.maximum_data_size=81920
sepio-nodemcu.upload.wait_for_upload_port=true
sepio-nodemcu.serial.disableDTR=true
sepio-nodemcu.serial.disableRTS=true

sepio-nodemcu.build.extra_flags=-DESP8266 -DSEPIO=1 -DMQTT_KEEPALIVE=180 -DMQTT_MAX_PACKET_SIZE=200
sepio-nodemcu.build.mcu=esp8266
sepio-nodemcu.build.f_cpu=160000000L
sepio-nodemcu.build.board=ESP8266_NODEMCU
sepio-nodemcu.build.core=esp8266
sepio-nodemcu.build.variant=generic
sepio-nodemcu.build.flash_mode=dio
sepio-nodemcu.build.flash_size=4M
sepio-nodemcu.build.flash_freq=40
sepio-nodemcu.build.debug_port=
sepio-nodemcu.build.debug_level=
sepio-nodemcu.build.hardcoded_network=

sepio-nodemcu.menu.CpuFrequency.160=160 MHz
sepio-nodemcu.menu.CpuFrequency.160.build.f_cpu=160000000L
sepio-nodemcu.menu.CpuFrequency.80=80 MHz
sepio-nodemcu.menu.CpuFrequency.80.build.f_cpu=80000000L

sepio-nodemcu.menu.UploadSpeed.921600=921600
sepio-nodemcu.menu.UploadSpeed.921600.upload.speed=921600

sepio-nodemcu.menu.FlashSize.4M3M=4M (3M SPIFFS)
sepio-nodemcu.menu.FlashSize.4M3M.build.flash_size=4M
sepio-nodemcu.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
sepio-nodemcu.menu.FlashSize.4M3M.build.spiffs_start=0x100000
sepio-nodemcu.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
sepio-nodemcu.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
sepio-nodemcu.menu.FlashSize.4M3M.build.spiffs_pagesize=256

# No need for this
#sepio-nodemcu.menu.FlashSize.4M1M=4M (1M SPIFFS)
#sepio-nodemcu.menu.FlashSize.4M1M.build.flash_size=4M
#sepio-nodemcu.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
#sepio-nodemcu.menu.FlashSize.4M1M.build.spiffs_start=0x300000
#sepio-nodemcu.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
#sepio-nodemcu.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
#sepio-nodemcu.menu.FlashSize.4M1M.build.spiffs_pagesize=256

sepio-nodemcu.menu.Debug.Disabled=Disabled
sepio-nodemcu.menu.Debug.Disabled.build.debug_port=
sepio-nodemcu.menu.Debug.Serial=Serial
sepio-nodemcu.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
sepio-nodemcu.menu.Debug.Serial1=Serial1
sepio-nodemcu.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1

sepio-nodemcu.menu.DebugLevel.None____=None
sepio-nodemcu.menu.DebugLevel.None____.build.debug_level=
sepio-nodemcu.menu.DebugLevel.Core____=Core
sepio-nodemcu.menu.DebugLevel.Core____.build.debug_level=-DDEBUG_ESP_CORE
sepio-nodemcu.menu.DebugLevel.SSL_____=Core + SSL
sepio-nodemcu.menu.DebugLevel.SSL_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL
sepio-nodemcu.menu.DebugLevel.SSL_MEM_=Core + SSL + TLS Mem
sepio-nodemcu.menu.DebugLevel.SSL_MEM_.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_TLS_MEM
sepio-nodemcu.menu.DebugLevel.WiFic___=Core + WiFi
sepio-nodemcu.menu.DebugLevel.WiFic___.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI
sepio-nodemcu.menu.DebugLevel.WiFi____=WiFi
sepio-nodemcu.menu.DebugLevel.WiFi____.build.debug_level=-DDEBUG_ESP_WIFI
sepio-nodemcu.menu.DebugLevel.HTTPClient=HTTPClient
sepio-nodemcu.menu.DebugLevel.HTTPClient.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT
sepio-nodemcu.menu.DebugLevel.HTTPClient2=HTTPClient + SSL
sepio-nodemcu.menu.DebugLevel.HTTPClient2.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_SSL
sepio-nodemcu.menu.DebugLevel.HTTPUpdate=HTTPUpdate
sepio-nodemcu.menu.DebugLevel.HTTPUpdate.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE
sepio-nodemcu.menu.DebugLevel.HTTPUpdate2=HTTPClient + HTTPUpdate
sepio-nodemcu.menu.DebugLevel.HTTPUpdate2.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE
sepio-nodemcu.menu.DebugLevel.HTTPUpdate3=HTTPClient + HTTPUpdate + Updater
sepio-nodemcu.menu.DebugLevel.HTTPUpdate3.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER
sepio-nodemcu.menu.DebugLevel.HTTPServer=HTTPServer
sepio-nodemcu.menu.DebugLevel.HTTPServer.build.debug_level=-DDEBUG_ESP_HTTP_SERVER
sepio-nodemcu.menu.DebugLevel.UPDATER=Updater
sepio-nodemcu.menu.DebugLevel.UPDATER.build.debug_level=-DDEBUG_ESP_UPDATER
sepio-nodemcu.menu.DebugLevel.OTA_____=OTA
sepio-nodemcu.menu.DebugLevel.OTA_____.build.debug_level=-DDEBUG_ESP_OTA
sepio-nodemcu.menu.DebugLevel.OTA2____=OTA + Updater
sepio-nodemcu.menu.DebugLevel.OTA2____.build.debug_level=-DDEBUG_ESP_OTA -DDEBUG_ESP_UPDATER
sepio-nodemcu.menu.DebugLevel.all_____=All
sepio-nodemcu.menu.DebugLevel.all_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_TLS_MEM

sepio-nodemcu.menu.HardcodedNetwork.None=None
sepio-nodemcu.menu.HardcodedNetwork.Bitraf=bitraf24
sepio-nodemcu.menu.HardcodedNetwork.Bitraf.build.hardcoded_network=-DWLAN_SSID=bitraf24 -DWLAN_PASSWORD=grimbadgerassault

